# Already present in MacOS but not updated
# brew "git"
# brew "gcc"
# brew "openssh"
# brew "bash"
# brew "zsh"
# brew "coreutils"

# UTILS
brew "wget" # Internet file retriever
brew "rsync" # Utility that provides fast incremental file transfer
brew "stow" # Organize software neatly under a single directory tree (e.g. /usr/local)
brew "wakeonlan" # Sends magic packets to wake up network-devices
# brew "parallel"
# brew "gnupg"
# brew "fclones" # Efficient Duplicate File Finder
# brew "fdupes" # Identify or delete duplicate files

# TOOLS
brew "ffmpeg" # Play, record, convert, and stream audio and video
brew "exiftool" # Perl lib for reading and writing EXIF metadata
# brew "ghostscript"
# brew "imagemagick"
# brew "docker"
# brew "docker-credential-helper"

# PROJECTS
# brew "gamdl"
# brew "gpac" # dependency of gamdl

# EDITORS
# brew "emacs"
# brew "micro"

# PROGRAMMING LANGUAGES
# brew "polyml"

# ZSH PLUGINS
# brew "spaceship"
# brew "zsh-autosuggestions"
# brew "zsh-fast-syntax-highlighting"

# FILEMANAGERS
# brew "lf"
# brew "ranger"
# brew "tree"

# RANDOM
brew "neofetch" # Fast, highly customisable system info script
# brew "pipes-sh"
# brew "sl"

# FONTS
cask "font-fira-code" # Monospaced font with programming ligatures
cask "font-hack-nerd-font" # Patched font with a high number of glyphs

# CASKS
cask "brave-browser" # Web browser focusing on privacy
cask "zen" # Gecko based web browser
cask "discord" # Voice and text chat software
cask "ghostty" # Terminal emulator that uses platform-native UI and GPU acceleration
cask "zed" # Multiplayer code editor
cask "miniconda" # Minimal installer for conda
cask "istat-menus" # System monitoring app
cask "grandperspective" # Graphically shows disk usage within a file system
cask "obsidian" # Knowledge base that works on top of a local folder of plain text Markdown files
cask "telegram" # Messaging app with a focus on speed and security
cask "whatsapp" # Native desktop client for WhatsApp
cask "calibre" # E-books management software
cask "numi" # Calculator and converter application
cask "the-unarchiver" # Unpacks archive files
cask "balenaetcher" # Tool to flash OS images to SD cards & USB drives
cask "pearcleaner"
cask "opencore-patcher" 

# cask "slack"
# cask "cursor"
# cask "docker-desktop"
# cask "intellij-idea-ce"
# cask "logitech-options"
# cask "obs"
# cask "ollama-app"
# cask "r-app"
# cask "rstudio"
# cask "trae"
# cask "visual-studio-code"
# cask "warp"
# cask "wireshark-app"