# Already present in MacOS but not updated
# brew "git"
# brew "gcc"
# brew "openssh"
# brew "bash"
# brew "zsh"
# brew "coreutils"

# UTILS
brew "wget" # Internet file retriever
brew "rsync" # Utility that provides fast incremental file transfer
brew "stow" # Organize software neatly under a single directory tree (e.g. /usr/local)
# brew "parallel"
# brew "gnupg"

# TOOLS
brew "ffmpeg" # Play, record, convert, and stream audio and video
brew "exiftool" # Perl lib for reading and writing EXIF metadata
# brew "ghostscript"
# brew "imagemagick"
# brew "docker"
# brew "docker-credential-helper"
# brew "wireguard-tools"

# PROJECTS
# brew "gamdl"
# brew "gpac"

# EDITORS
# brew "emacs"
# brew "micro"

# PROGRAMMING LANGUAGES
# brew "polyml"

# ZSH PLUGINS
# brew "spaceship"
# brew "zsh-autosuggestions"
# brew "zsh-fast-syntax-highlighting"

# FILEMANAGERS
# brew "lf"
# brew "ranger"
# brew "tree"

# RANDOM
brew "neofetch" # Fast, highly customisable system info script
# brew "pipes-sh"
# brew "sl"

# CASKS
cask "brave-browser" # Web browser focusing on privacy
# cask "discord" # Voice and text chat software
cask "font-fira-code" # Monospaced font with programming ligatures
cask "font-hack-nerd-font" # Patched font with a high number of glyphs
cask "ghostty" # Terminal emulator that uses platform-native UI and GPU acceleration
cask "grandperspective" # Graphically shows disk usage within a file system
cask "istat-menus" # System monitoring app
cask "miniconda" # Minimal installer for conda
cask "obsidian" # Knowledge base that works on top of a local folder of plain text Markdown files
cask "telegram" # Messaging app with a focus on speed and security
cask "whatsapp" # Native desktop client for WhatsApp
cask "zed" # Multiplayer code editor
cask "zen" # Gecko based web browser

# cask "slack"
# cask "cursor"
# cask "docker-desktop"
# cask "intellij-idea-ce"
# cask "logitech-options"
# cask "obs"
# cask "ollama-app"
# cask "r-app"
# cask "rstudio"
# cask "trae"
# cask "visual-studio-code"
# cask "warp"
# cask "wireshark-app"
cask "numi"
cask "calibre"

brew "tw93/tap/mole"
cask "pearcleaner"
cask "the-unarchiver"
cask "opencore-patcher"
